app/Http/Controllers/Site/SiteController.php

select * from `carousels` order by `created_at` desc
select * from `products` where `featured` = 1 order by `created_at` desc limit 10
select * from `categories` where `featured` = 1 order by `ord` asc
select * from `settings`
---
    public function viewHomePage()
    {
        $carousels = Carousel::latest()->get();
        $products = Product::where('featured', 1)->latest()->limit(10)->get();
        $categores = Category::where('featured', 1)->orderBy('ord', 'ASC')->get();
        $setting = Setting::all();