app/Providers/AppServiceProvider.php

select * from `settings`
select * from `categories` limit 15
---
    public function boot()
    {
        $setting = Setting::get();
        $header_logo = $setting->where('key', 'header_logo')->first()->value;
        view()->share('header_logo', $header_logo);
        view()->share('setting', $setting);
        view()->composer('layouts.layoutSite.Footer', function ($view) {
            $setting = Setting::all();
            $header_logo = $setting->where('key', 'header_logo')->first()->value;
            $phone = $setting->where('key', 'phone1')->first()->value;
            $address = $setting->where('key', 'address')->first()->value;
            $addressen = $setting->where('key', 'addressen')->first()->value;
            $email = $setting->where('key', 'email')->first()->value;
            $footer_about = $setting->where('key', 'footer_about')->first()->value;
            $facebook_link = $setting->where('key', 'facebook_link')->first()->value;
            $instagram_link = $setting->where('key', 'instagram_link')->first()->value;
            $youtube_link = $setting->where('key', 'youtube_link')->first()->value;
            $twitter_link = $setting->where('key', 'twitter_link')->first()->value;
            $categories = Category::limit(15)->get();

select * from `settings`
select * from `categories` order by `ord` asc
---

            }else{  $order = 1;}

            $setting = Setting::all();
            $categories = Category::orderBy('ord', 'ASC')->get();

select * from `settings`
---
            $facebook_link = $setting->where('key', 'facebook_link')->first()->value;
            $instagram_link = $setting->where('key', 'instagram_link')->first()->value;
            $twitter_link = $setting->where('key', 'twitter_link')->first()->value;
            $setting = Setting::all();

select * from `settings`
---
        });

        view()->composer('layouts.layoutSite.SitePage', function ($view) {
            $setting = Setting::all();